homework/Lab02/combustorSimple/0/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.0 10.0 0.0);
    }

    outlet
    {
        type            zeroGradient;
    }

    splitter
    {
        type            noSlip;
    }

    fuel_inlet
    {
        type            fixedValue;
        value           uniform (0.0 15.0 0.0);
    }

    back
    {
        type            noSlip;
    }

    sides
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
