homework/Lab02/combustorSimple/0/nut
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0.0;
    }

    splitter
    {
        type            nutkWallFunction;
        value           uniform 0.0;
    }

    fuel_inlet
    {
        type            calculated;
        value           uniform 0.0;
    }

    back
    {
        type            nutkWallFunction;
        value           uniform 0.0;
    }

    sides
    {
        type            nutkWallFunction;
        value           uniform 0.0;
    }

    frontAndBack
    {
        type            empty;
    }
}
