homework/Lab02/combustorSimple/0/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    
    outlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    
    splitter
    {
        type            zeroGradient;
    }
    
    fuel_inlet
    {
        type            zeroGradient;
    }
    
    back
    {
        type            zeroGradient;
    }
    
    sides
    {
        type            zeroGradient;
    }
    
    frontAndBack
    {
        type            empty;
    }
}
